Revit 2024 API
WireDistributionDirection Enumeration
 Defines the direction of the distribution of wires in a Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum WireDistributionDirection
Visual Basic
Public Enumeration WireDistributionDirection
Visual C++
public enum class WireDistributionDirection
Members
Member name | Description
Major |  Wires are distributed in the Major direction. Uncomment following for 2020.1 text "Major"
Minor |  Wires are distributed in the Minor direction. Uncomment following for 2020.1 text "Minor"
See Also
Autodesk.Revit.DB.Structure Namespace